var status = -1;

function action(mode, type, selection) {
  if (mode == 1) {
    status++;
  } else {
    if (status == 0) {
      cm.dispose();
    }
    status--;
  }
  if (status == 0) {
    if (cm.getPlayerStat("LVL") < 29) {
      cm.sendOk("你的等級不能小於30等.");
      cm.safeDispose();
    }
    if (cm.haveItem(5220000)) { //快樂百寶券
      cm.sendYesNo("你持有#b轉蛋券#k你要試試手氣嗎?");
    } else {
      cm.sendOk("你沒有轉蛋券，請收集完成再來轉蛋哦.");
      cm.safeDispose();
    }
  } else if (status == 1) {
    var item;
    var cha = Math.floor(Math.random() * 300);
    if (!cm.haveItem(5220000)) {
      cm.sendOk("你沒有轉蛋券，請收集完成再來轉蛋哦.");
      cm.safeDispose();
      return;
    }
    if (Math.floor(Math.random() * 100) == 5) {
      var itemList = new Array(
        1102000, //綠色冒險披風
        1102001, //藍色冒險披風
        1102002, //紅色冒險披風
        1102003, //白色冒險披風
        1102004, //黑色冒險披風
        1102011, //藍色守護披風
        1102031, //綠龍紋披風
        1102032, //紫龍紋披風
        1102033, //紅龍紋披風
        1102034, //藍龍紋披風
        1102035, //黑龍紋披風
        1102040, //浪人披風(黃)
        1102041, //浪人披風(粉)
        1102042, //浪人披風(紫)
        1102043, //浪人披風(褐)
        //-------武器------
        1302087, //火炬
        1312012, //乾坤圈
        1322003, //棒棒果
        1332053, //野外燒烤串
        1402044, //南瓜燈籠
        1012056, //狗狗鼻
        1302049 //光線鞭子
      );
      item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "潮流轉蛋機");
    } else if (Math.floor(Math.random() * 40) == 2) {
      var itemList = new Array(
        3010161, //老鼠椅子
        3010007, //粉紅海豹抱枕椅
        3010008, //藍色海豹抱枕椅
        3010010, //白色海豹抱枕椅
        3010016, //黑色海豹抱枕
        3010017, //金色海豹抱枕
        3010029, //藍色五環椅
        3010030, //黑色五環椅
        3010031, //紅色五環椅
        3010032, //黃色五環椅
        3010033, //綠色五環椅
        3010041, //骷髏寶座
        3010048, //耶誕樹椅子
        3010049, //冰窖椅
        3010050, //玩偶椅
        3010057, //紅色鵝絨椅子
        3010058, //黑色鵝絨椅子
        3010068, //荷葉下椅子
        3010025, //楓樹下
        3010026, //幽魂發條熊椅
        1312002, //鐮刀
        3010123, //花漾彩蝶椅
        3010021, //暖暖桌
        3010024, //粉紅發條熊椅子
        3010124, //杜那斯的守護
        3010028, //俘虜我吧！椅子
        3010036, //盪鞦韆
        3010047, //藍龍椅
        3010038, //透明椅
        3010046, //赤龍椅
        3010037, //小肥肥蚊香椅子
        3010027, //奇多元氣加倍椅
        3010125, //帝國巡洋戰艦
        3010002, //綠色設計師椅
        3010013, //遮陽椅
        3010014, //彎彎月亮
        3010040, //Bat Chair
        3010043, //女巫掃把
        3010044, //秋天椅
        3010051, //公砂兔椅
        3010052, //母砂兔椅
        3010085, //Olivia's Chair
        3010092, //魔女掃把
        3010069, //機器人椅
        3010095, //石巨人座椅
        3010004, //黃色休閒椅
        3010005, //紅色休閒椅
        3010075, //留聲機椅
        3010073, //皮卡啾椅
        3010072, //酋長椅
        3010118 //音符椅子
      );
      item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1, "潮流轉蛋機");

    } else if (Math.floor(Math.random() * 10) == 2) {
      var itemList = new Array(
        //10%卷軸
        2040031, //頭盔敏捷卷軸10%
        2040005, //頭盔體力卷軸10%
        2040002, //頭盔防禦卷軸10%
        2040026, //頭盔智力卷軸10%
        2040100, //臉部裝飾生命卷軸10%
        2040200, //眼部裝飾命中率卷軸10%
        2040205, //眼部裝飾智力卷軸10%
        2040302, //耳環智力卷軸10%
        2040302, //耳環智力卷軸10%
        2040310, //耳環防禦力卷軸10%
        2040328, //耳環裝飾體力卷軸10%
        2040402, //上衣防禦卷軸10%
        2040412, //上衣運氣卷軸10%
        2040419, //上衣力量卷軸10%
        2040422, //上衣體力卷軸10%
        2040427, //上衣運氣卷軸10%
        2040502, //全身鎧甲敏捷卷軸10%
        2040505, //全身鎧甲防禦卷軸10%
        2040514, //全身鎧甲智力卷軸10%
        2040517, //全身鎧甲運氣卷軸10%
        2040534, //全身盔甲力量卷軸10%
        2040602, //褲/裙防禦卷軸10%
        2040612, //褲裙敏捷卷軸10%
        2040619, //褲裙跳躍卷軸10%
        2040622, //褲裙體力卷軸10%
        2040627, //褲裙敏捷卷軸10%
        2040702, //鞋子敏捷度卷軸10%
        2040705, //鞋子跳躍卷軸10%
        2040708, //鞋子速度卷軸10%
        2040802, //手套敏捷卷軸10%
        2040805, //手套攻擊卷軸10%
        2040825, //手套體力卷軸10%
        2040902, //盾牌防禦卷軸10%
        2040915, //盾牌攻擊卷軸10%
        2040920, //盾牌魔力卷軸10%
        2040925, //盾牌運氣卷軸10%
        2040928, //盾牌體力卷軸10%
        2040933, //盾牌力量卷軸10%
        2041002, //披風魔防卷軸10%
        2041005, //披風防禦卷軸10%
        2041008, //披風體力卷軸10%
        2041023, //披風運氣卷軸10%
        2041020, //披風敏捷卷軸10%
        2041017, //披風智力卷軸10%
        2041014, //披風力量卷軸10%
        2041011, //披風魔力卷軸10%
        2041201, //項鏈運氣卷軸10%
        2041206, //項鏈力量卷軸10%
        2041302, //腰帶力量卷軸10%
        2041305, //腰帶智力卷軸10%
        2041308, //腰帶敏捷卷軸10%
        2041311 //腰帶運氣卷軸10%
      );
      item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1);

    } else if(Math.floor(Math.random() * 10) == 0){
      item = cm.gainGachaponItem(4031365, Math.floor(Math.random() * 15));
    } else if (Math.floor(Math.random() * 2) == 0) {
      var itemList = new Array(
        1082145, //工地手套(黃)
        1082146, //工地手套(紅)
        1082147, //工地手套(藍)
        1082148, //工地手套(紫)
        1082149, //工地手套(褐)
        1082150, //工地手套(灰)
        1302025, //紅雨傘
        1302026, //黑雨傘
        1302027, //綠雨傘
        1302028, //紫雨傘
        1302029, //褐雨傘
        1302049, //光線鞭子
        1302054, //湯勺
        1322009, //馬桶吸
        1302061, //蔓藤鞭子
        1302016, //黃色雨傘
        1302017, //藍色雨傘
        1302021, //橡皮榔頭
        1302024, //廢報紙卷
        1312013, //判官筆
        1302000, //劍
        1302001, //鋸
        1322008, //公事包
        1332007, //短刀
        1372013, //竹杖
        1382015, //毒之菇
        1402014, //溫度計
        1412001, //鐵斧
        1422000, //木槌
        1442039, //冷凍金槍魚
        1482065, //虎爪指虎
        1002452, //黑星白頭巾
        1002453, //白星黑頭巾
        1002454, //紅星黑頭巾
        1002455, //黑星紅頭巾
        1002894, //粉色編織發帶
        1002895, //紅色編織發帶
        1002896, //紫色編織發帶
        1002897, //橙色編織發帶
        1002898, //綠色編織發帶
        1002899, //黃色編織發帶
        1002800, //藍色編織發帶
        2022176,
        2022113,
        2043202,
        2043201,
        2044102,
        2044101,
        2040602,
        2040601,
        2043302,
        2043301,
        2040002,
        2040001,
        2044402,
        2002017,
        1402010,
        1312014,
        1442017,
        1002063,
        1060062,
        1050018,
        1002392,
        1040037,
        1002160,
        1060005,
        1332009,
        1332008,
        1442009,
        1302004,
        1312006,
        1002154,
        1002175,
        1060064,
        1061088,
        1402012,
        1002024,
        1312005,
        1432002,
        1302050,
        1002048,
        1040061,
        1041067,
        1002131,
        1072263,
        1332001,
        1312027,
        1322015,
        1432006,
        1041088,
        1061087,
        1402013,
        1302051,
        1002023,
        1402006,
        1322000,
        1372002,
        1442001,
        1422004,
        1432003,
        1040088,
        1002100,
        1041004,
        1061047,
        1322022,
        1040021,
        1061091,
        1102012,
        1050006,
        1060018,
        1041044,
        1041024,
        1041087,
        1082146,
        1332043,
        1062001,
        1051014,
        1402030,
        1432004,
        1060060,
        1432018,
        1002096,
        1442010,
        1422003,
        1472014,
        1002021,
        1060060,
        1442031,
        1402000,
        1040089,
        1432005,
        3010013,
        2022113,
        1302026,
        2022113,
        2002018,
        1382001,
        1050008,
        1442017,
        1002084,
        1050003,
        1002064,
        1061006,
        1051027,
        1442009,
        1050056,
        1051047,
        1050049,
        1040080,
        1051055,
        1372010,
        1422005,
        1002143,
        1302027,
        1061087,
        1372003,
        1302019,
        1051023,
        1050054,
        1061083,
        1051017,
        1002028,
        1322010,
        1332013,
        1050055,
        1002245,
        2022113,
        2002017,
        1402010,
        1312014,
        1442017,
        1002063,
        1060062,
        1050018,
        1002392,
        1040037,
        1002160,
        1060005,
        1332009,
        1332008,
        1442009,
        1302004,
        1312006,
        1002154,
        1002175,
        1060064,
        1061088,
        1402012,
        1002024,
        1312005,
        1432002,
        1302050,
        1002048,
        1040061,
        1041067,
        1002131,
        1072263,
        1332001,
        1312027,
        1322015,
        1432006,
        1041088,
        1061087,
        1402013,
        1302051,
        1002023,
        1402006,
        1322000,
        1372002,
        1442001,
        1422004,
        1432003,
        1040088,
        1002100,
        1041004,
        1061047,
        1322022,
        1040021,
        1061091,
        1102012,
        1050006,
        1060018,
        1041044,
        1041024,
        1041087,
        1082146,
        1332043,
        1062001,
        1051014,
        1402030,
        1432004,
        1060060,
        1432018,
        1002096,
        1442010,
        1422003,
        1472014,
        1002021,
        1060060,
        1442031,
        1402000,
        1040089,
        1432005,
        5062002,
        5062003,
        5062005,
        2340000,
        1342033,
        1372078,
        1382099,
        1402090,
        1412062,
        1422063,
        1432081,
        1442111,
        1452106,
        1462091,
        1472117,
        1482079,
        1492079,
        1302147,
        1312062,
        1322090,
        1332120,
        1332125,
        1022082,
        1072238
      );
      item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], 1);
    } else {
      var itemList = new Array(
        2000004, //特殊藥水
        2000005 //超級藥水
      );
      item = cm.gainGachaponItem(itemList[Math.floor(Math.random() * itemList.length)], Math.floor(Math.random() * 20));
    }
    if (item != -1) {
      cm.gainItem(5220000, -1);
      cm.sendOk("你得到了 #b#t" + item + "##k.");
    } else {
      cm.sendOk("請確認背包是否已經滿了以及是否有轉蛋卷唷。");
    }
    cm.safeDispose();
  }
}
