/**
 * npc id: 9330118
 * npc name: 卷軸轉蛋機
 *
 * author: freedom
 *
 * 錯誤代碼對照表
 * 1：總機率和不為 1000
 * 2：有物品為空陣列
 */

var status = -1;

var items = {
  // 請務必確認機率加總是否為 1000

  reel1: {
    // 機率，千分之 x
    chance: 300,

    // 數量，範圍是 1 ~ x
    quantity: 1,

    // 廣播名稱，null 為不廣播
    broad: '卷軸轉蛋機',

    // 物品
    collection: [
      2040014, //頭盔命中率詛咒卷軸70%
      2040015, //頭盔命中率詛咒卷軸30
      2040017, //頭盔命中率卷軸60%
      2040025, //頭盔智力卷軸60%
      2040028, //頭盔敏捷卷軸70%
      2040029, //頭盔敏捷卷軸60%
      2040043, //頭盔敏捷卷軸65%
      2040106, //臉部裝飾回避率卷軸60%
      2040108, //臉部裝飾回避率詛咒卷軸30%
      2040109, //臉部裝飾回避率詛咒卷軸70%
      2040205, //眼部裝飾智力卷軸10%
      2040206, //眼部裝飾智力卷軸60%
      2040208, //眼部裝飾智力詛咒卷軸30%
      2040209, //眼部裝飾智力詛咒卷軸70%
      2040233, //眼飾力量卷軸,  //為眼飾增加力量屬性。\n成功率：60%，力量+2
      2040234, //眼飾敏捷卷軸,  //為眼飾增加敏捷屬性。\n成功率：60%，敏捷+2
      2040235, //眼飾智力卷軸,  //為眼飾增加智力屬性。\n成功率：60%，智力+2
      2040236, //眼飾運氣卷軸,  //為眼飾增加運氣屬性。\n成功率：60%，運氣+2
      2040301, //耳環智力卷軸60%,  //成功率60%，魔法攻擊力+2，智力+1
      2040304, //耳環智力詛咒卷軸,  //成功率70%，魔法攻擊力+2，智力+1\n但失敗時50%的比率道具消失
      2040305, //耳環智力詛咒卷軸%30
      2040306, //耳環敏捷卷軸,  //成功率70%，敏捷+2\n但失敗時50%的比率道具消失
      2040307, //耳環敏捷卷軸,  //成功率30%，敏捷+3\n但失敗時50%的比率道具消失
      2040313, //耳環智力卷軸65%
      2040317, //耳環敏捷卷軸60%,  //耳朵裝飾中增加敏捷性上升選項。\n成功率:60%, 敏捷+2
      2040320, //耳環運氣卷軸70%,
      2040321, //耳環裝飾運氣卷軸60%,  //給耳環裝飾增加運氣.\n成功率:60%, 運氣+2
      2040322, //耳環裝飾運氣卷軸30%,
      2040335, //耳環裝飾敏捷卷軸65%,  //提高耳朵裝飾品敏捷.\n成功率:65%, 敏捷+2
      2040337, //耳環裝飾運氣卷軸65%,  //提高耳朵裝飾品運氣.\n成功率:65%, 運氣+2
      2040339, //耳環裝飾體力卷軸65%,  //為耳飾增加體力屬性。\n成功率：65%，最大HP+60
      2040406, //上衣力量卷軸,  //成功率70%，力量+2\n但失敗時50%的比率道具消失
      2040407, //上衣力量卷軸,  //成功率30%，力量+3\n但失敗時50%的比率道具消失
      2040413, //上衣運氣卷軸60%,  //成功率60%、運氣+2、回避率+1。
      2040418, //上衣力量卷軸60%,  //上衣中增加力量上升選項。\n成功率 60%, 力量+2
      2040424, //上衣運氣卷軸70%,
      2040425, //上衣運氣卷軸60%,  //給上衣增加運氣.\n成功率:60%, 運氣+2
      2040501, //全身鎧甲敏捷卷軸60%,
      2040508, //全身鎧甲敏捷詛咒卷軸%70
      2040513, //全身鎧甲智力卷軸60%
      2040516, //全身鎧甲運氣卷軸60%,
      2040518, //全身盔甲智力卷軸%70
      2040519, //全身盔甲智力卷軸%30
      2040520, //全身盔甲幸運卷軸%70
      2040521, //全身盔甲幸運卷軸%30
      2040522, //全身盔甲敏捷卷軸65%,
      2040524, //全身盔甲防禦卷軸65%
      2040526, //全身盔甲智力卷軸65%
      2040528, //全身盔甲幸運卷軸65%,
      2040531, //全身盔甲力量卷軸%70
      2040532, //全身盔甲力量卷軸60%
      2040540, //全身盔甲力量卷軸65%
      2040610, //褲裙敏捷詛咒卷軸70%
      2040613, //褲裙敏捷卷軸60%,  //成功率60%、敏捷+2、移動速度+1。
      2040618, //褲裙跳躍卷軸60%,  //為裙褲增加跳躍力屬性。\n成功率：60%，跳躍力+2，回避值+20
      2040624, //褲裙敏捷卷軸%70 %50失敗
      2040625, //褲裙敏捷卷軸60%,  //為裙褲增加敏捷屬性。\n成功率：60%，敏捷+2，命中值+20
      2040635, //褲裙敏捷卷軸65%,  //為裙褲增加敏捷屬性。\n成功率：65%，敏捷+2，命中值+20
      2040704, //鞋子跳躍卷軸60%,  //成功率60%，跳躍力+2，敏捷+1.
      2040714, //鞋子跳躍詛咒卷軸,  //成功率70%，跳躍力+2，敏捷+1\n但失敗時50%的比率道具消失
      2040715, //鞋子跳躍詛咒卷軸,
      2040801, //手套敏捷卷軸60%,  //為手套增加敏捷屬性。\n成功率：60%，命中值+40，敏捷+1
      2040803, //手套攻擊卷軸,  //成功率100%，物理攻擊力+1.
      2040804, //手套攻擊卷軸60%,  //成功率60%，物理攻擊力+2.
      2040810, //手套攻擊詛咒卷軸,  //成功率70%，物理攻擊力+2\n但失敗時50%的比率道具消失
      2040811, //手套攻擊詛咒卷軸,  //成功率30%，物理攻擊力+3\n但失敗時50%的比率道具消失
      2040819, //手套敏捷卷軸65%,  //為手套增加敏捷屬性。\n成功率：65%，命中值+40，敏捷+1
      2040820, //手套敏捷卷軸15%,
      2040821, //手套攻擊卷軸65%,  //用來給手套中增加攻擊屬性。\n成功率：65%，攻擊力+2
      2040906, //盾牌運氣卷軸,  //成功率70%，運氣+2\n但失敗時50%的比率道具消失
      2040907, //盾牌運氣卷軸,
      2040916, //盾牌攻擊詛咒卷軸70%,
      2040919, //盾牌魔力卷軸60%,  //在盾牌賦予魔力提升屬性。\n成功率：60%，魔法攻擊力+2、智力+1
      2040921, //盾牌魔力詛咒卷軸70%,
      2040922, //盾牌魔力詛咒卷軸30%,
      2040924, //盾牌運氣卷軸60%,  //盾牌中增加運氣上升選項。\n成功率:60%, 幸運+2
      2040931, //盾牌力量卷軸60%,  //給盾牌增加力量.\n成功率:60%, 力量+2
      2040937, //盾牌運氣卷軸65%,  //提高盾牌的運氣.\n成功率:65%, 運氣+2
      2040941, //盾牌力量卷軸65%,  //提高盾牌的力量.\n成功率:65%, 力量+2
      2041013, //披風力量卷軸60%,  //成功率60%，力量+2
      2041016, //披風智力卷軸60%,  //成功率60%，智力+2
      2041019, //披風敏捷卷軸60%,  //成功率60%，敏捷+2
      2041022, //披風運氣卷軸60%,  //成功率60%，運氣+2
      2041034, //披風力量詛咒卷軸,  //成功率70%，力量+2\n但失敗時50%的比率道具消失
      2041036, //披風智力詛咒卷軸,  //成功率70%，智力+2\n但失敗時50%的比率道具消失
      2041038, //披風敏捷詛咒卷軸,  //成功率70%，敏捷+2\n但失敗時50%的比率道具消失
      2041040, //披風運氣詛咒卷軸,  //成功率70%，運氣+2\n但失敗時50%的比率道具消失
      2041050, //披風力卷軸65%,  //用來增加披風的力量屬性。\n成功率：65%，力量+2
      2041052, //披風智力卷軸65%,  //用來增加披風的智力屬性。\n成功率：65%，智力+2
      2041054, //披風敏捷卷軸65%,  //用來增加披風的敏捷屬性。\n成功率：65%，敏捷+2
      2041056, //披風幸運卷軸65%,  //用來增加披風的幸運屬性。\n成功率：65%，幸運+2
      2041202, //項鏈運氣卷軸60%,  //成功率60%，運氣+2
      2041207, //項鏈力量卷軸60%,  //成功率60%，力量+2
      2041210, //項鏈力量詛咒卷軸70%
      2041301, //腰帶力量卷軸60%
      2041304, //腰帶智力卷軸60%
      2041307, //腰帶敏捷卷軸60%
      2041310, //腰帶運氣卷軸60%
      2041312, //腰帶力量卷軸70%
      2041314, //腰帶智力卷軸70%
      2041316, //腰帶敏捷卷軸70%
      2041318, //腰帶運氣卷軸70
      2043001, //單手劍攻擊卷軸60%
      2043004, //單手劍攻擊詛咒卷軸
      2043011, //單手劍攻擊卷軸65%
      2043101, //單手斧攻擊卷軸60%
      2043104, //單手斧攻擊詛咒卷軸
      2043106, //單手斧攻擊卷軸65%
      2043201, //單手鈍器攻擊卷軸60%
      2043204, //單手鈍器攻擊詛咒卷軸
      2043206, //單手鈍器攻擊卷軸65%
      2043301, //短劍攻擊卷軸60%
      2043304, //短劍攻擊詛咒卷軸
      2043306, //短劍攻擊卷軸65%
      2043401, // 刀攻擊力卷軸 60%
      2043403, //刀攻擊力卷軸
      2043701, //短杖魔力卷軸60%
      2043704, //短杖魔力詛咒卷軸
      2043706, //短杖魔力卷軸65%
      2043801, //長杖魔力卷軸60%
      2043804, //長杖魔力詛咒卷軸
      2043806, //長杖魔力卷軸65%
      2044001, //雙手劍攻擊卷軸60%
      2044004, //雙手劍攻擊詛咒卷軸
      2044006, //雙手劍攻擊卷軸65%
      2044101, //雙手斧攻擊卷軸60%
      2044104, //雙手斧攻擊詛咒卷軸
      2044106, //雙手斧攻擊卷軸65%
      2044201, //雙手鈍器攻擊卷軸60%
      2044204, //雙手鈍器攻擊詛咒卷軸
      2044206, //雙手鈍器攻擊卷軸65%
      2044301, //槍攻擊卷軸60%
      2044304, //槍攻擊詛咒卷軸
      2044306, //槍攻擊卷軸65%
      2044401, //矛攻擊卷軸60%
      2044404, //矛攻擊詛咒卷軸
      2044406, //矛攻擊卷軸65%
      2044501, //弓攻擊卷軸60%
      2044504, //弓攻擊詛咒卷軸
      2044506, //弓攻擊卷軸65%
      2044601, //弩攻擊卷軸60%
      2044604, //弩攻擊詛咒卷軸
      2044606, //弩攻擊卷軸65%
      2044701, //拳套攻擊卷軸60%
      2044704, //拳套攻擊詛咒卷軸
      2044706, //拳套攻擊卷軸65%
      2044801, //拳甲攻擊卷軸60%
      2044803, //拳甲攻擊卷軸
      2044811, //拳甲攻擊卷軸65%
      2044901, //短槍攻擊卷軸60%
      2044903, //短槍攻擊卷軸
      2044906, //火槍攻擊捲軸65%
      2040012  //頭盔智力卷軸70%
    ]
  },

  reel2: {
    // 機率，千分之 x
    chance: 500,

    // 數量，範圍是 1 ~ x
    quantity: 1,

    // 廣播名稱，null 為不廣播
    broad: null,

    // 物品
    collection: [
      2040001, //頭盔防禦卷軸60%
      2040002, //頭盔防禦卷軸10%
      2040003, //頭盔體力卷軸
      2040004, //頭盔體力卷軸60%
      2040005, //頭盔體力卷軸10%
      2040008, //頭盔防禦詛咒卷軸%70 %50失敗
      2040009, //頭盔防禦詛咒卷軸%30 %50失敗
      2040010, //頭盔體力詛咒卷軸70%
      2040011, //頭盔體力詛咒卷軸30%
      2040013, //頭盔智力卷軸30%
      2040016, //頭盔命中率卷軸10%
      2040018, //頭盔命中率卷軸100%
      2040019, //頭盔防禦卷軸65%
      2040020, //頭盔防禦卷軸15%
      2040021, //頭盔體力卷軸65%
      2040022, //頭盔體力卷軸15%
      2040024, //頭盔智力卷軸100%
      2040026, //頭盔智力卷軸10%
      2040027, //頭盔敏捷卷軸100%
      2040030, //頭盔敏捷卷軸30%
      2040031, //頭盔敏捷卷軸10%
      2040044, //頭盔敏捷卷軸15%
      2040100, //臉部裝飾生命卷軸10%
      2040101, //臉部裝飾生命卷軸60%
      2040103, //臉部裝飾生命詛咒卷軸30%
      2040104, //臉部裝飾生命詛咒卷軸70%
      2040105, //臉部裝飾回避率卷軸10%
      2040200, //眼部裝飾命中率卷軸10%
      2040201, //眼部裝飾命中率卷軸60%
      2040203, //眼部裝飾命中率詛咒卷軸30%
      2040204, //眼部裝飾命中率詛咒卷軸70%
      2040300, //耳環智力卷軸,  //成功率100%，魔法攻擊力+1.
      2040302, //耳環智力卷軸10%
      2040308, //耳環防禦力詛咒卷軸70%
      2040309, //耳環防禦力詛咒卷軸30%
      2040310, //耳環防禦力卷軸10%,  //成功率10%、物理防禦力+3、魔法防禦力+3、命中率+1。
      2040311, //耳環防禦力卷軸60%,  //成功率60%、物理防禦力+1、魔法防禦力+1。
      2040312, //耳環防禦力卷軸100%,  //成功率100%、物理防禦力+1。
      2040314, //耳環智力卷軸15%
      2040316, //耳環敏捷卷軸,  //耳朵裝飾中增加敏捷性上升選項。\n成功率:100%, 敏捷+1
      2040318, //耳環敏捷卷軸10%,  //耳朵裝飾中增加敏捷性上升選項。\n成功率:10%, 敏捷+3
      2040319, //耳環裝飾運氣卷軸,  //給耳環裝飾增加運氣.\n成功率:100%, 運氣+1
      2040323, //耳環運氣卷軸10%,  //給耳朵裝飾增加運氣.\n成功率:10%, 運氣+3
      2040324, //耳環裝飾體力卷軸 ,  //為耳飾增加體力屬性。\n成功率：100%，最大HP+20
      2040325, //耳環裝飾體力卷軸 ,
      2040326, //耳環裝飾體力卷軸60%,  //為耳飾增加體力屬性。\n成功率：60%，最大HP+60
      2040327, //耳環裝飾體力卷軸 ,
      2040328, //耳環裝飾體力卷軸10%,  //為耳飾增加體力屬性。\n成功率：10%，最大HP+120
      2040329, //耳環敏捷卷軸,  //為耳環增加敏捷屬性。\n成功率：10%，敏捷+3
      2040330, //耳環智力卷軸,
      2040331, //耳環運氣卷軸,  //為耳環增加運氣屬性。n成功率：10%，運氣+3
      2040336, //耳環裝飾敏捷卷軸15%,  //提高耳朵裝飾品敏捷.\n成功率:15%, 敏捷+3
      2040338, //耳環裝飾運氣卷軸15%,  //提高耳朵裝飾品運氣.\n成功率:15%, 運氣+3
      2040340, //耳環裝飾體力卷軸15%,  //為耳飾增加體力屬性。\n成功率：15%，最大HP+120
      2040400, //上衣防禦卷軸,  //為上衣增加物理防禦力屬性。\n成功率：100%，物理防禦力+10
      2040401, //上衣防禦卷軸60%,
      2040402, //上衣防禦卷軸10%,
      2040403, //上衣防禦必成卷,
      2040404, //上衣防禦詛咒卷軸,
      2040405, //上衣防禦詛咒卷軸,
      2040408, //上衣體力卷軸,
      2040409, //上衣體力卷軸,
      2040410, //上衣運氣詛咒卷軸70%,
      2040411, //上衣運氣詛咒卷軸30%,
      2040412, //上衣運氣卷軸10%,  //成功率10%、運氣+3、回避率+3。
      2040414, //上衣運氣卷軸100%,  //成功率100%、運氣+1。
      2040415, //上衣防禦力卷軸65%,
      2040416, //上衣防禦力卷軸15%,
      2040417, //上衣力量卷軸,  //上衣中增加力量上升選項。\n成功率 100%, 力量+1
      2040419, //上衣力量卷軸10%,  //上衣中增加力量上升選項。\n成功率 10%, 力量+3
      2040420, //上衣體力卷軸,  //為上衣增加體力屬性。\n成功率：100%，最大HP+ 20
      2040421, //上衣體力卷軸60%,  //為上衣增加體力屬性。\n成功率：60%，最大HP+ 60
      2040422, //上衣體力卷軸10%,  //為上衣增加體力屬性。\n成功率：10%，最大HP+ 120
      2040423, //上衣運氣卷軸,  //給上衣增加運氣.\n成功率:100%, 運氣+1
      2040426, //上衣運氣卷軸30%,
      2040427, //上衣運氣卷軸10%,  //給上衣增加運氣.\n成功率:10%, 運氣+3
      2040431, //上衣力量卷軸65%,  //提高上衣的力量.\n成功率 65%, 力量+2
      2040432, //上衣力量卷軸15%,  //提高上衣的力量.\n成功率 15%, 力量+3
      2040433, //上衣體力卷軸65%,  //為上衣增加體力屬性。\n成功率：65%，最大HP+ 60
      2040434, //上衣體力卷軸15%,  //為上衣增加體力屬性。\n成功率：15%，最大HP+ 120
      2040435, //上衣運氣卷軸65%,  //提高上衣的運氣.\n成功率:65%, 運氣+2
      2040436, //上衣運氣卷軸15%,  //提高上衣的運氣.\n成功率:15%, 運氣+3
      2040500, //全身鎧甲敏捷卷軸,  //成功率100%，敏捷+1.
      2040502, //全身鎧甲敏捷卷軸10%,
      2040503, //全身鎧甲防禦卷軸,
      2040504, //全身鎧甲防禦卷軸60%
      2040505, //全身鎧甲防禦卷軸10%
      2040509, //全身鎧甲敏捷詛咒卷軸%30
      2040510, //全身鎧甲防禦詛咒卷軸%70
      2040511, //全身鎧甲防禦詛咒卷軸%30
      2040512, //全身鎧甲智力卷軸,  //成功率100%，智力+1
      2040514, //全身鎧甲智力卷軸10%
      2040515, //全身鎧甲運氣卷軸,  //成功率100%，運氣+1
      2040517, //全身鎧甲運氣卷軸10%
      2040523, //全身盔甲敏捷卷軸15%
      2040525, //全身盔甲防禦卷軸15%
      2040527, //全身盔甲智力卷軸15%
      2040529, //全身盔甲幸運卷軸15%
      2040530, //全身盔甲力量卷軸,  //給全身盔甲增加力量.\n成功率:100%, 力量+1
      2040533, //全身盔甲力量卷軸%30
      2040534, //全身盔甲力量卷軸10%
      2040541, //全身盔甲力量卷軸15%
      2040600, //褲/裙防禦卷軸,  //為裙褲增加物理防禦力屬性。\n成功率：100%，物理防禦力+10
      2040601, //褲/裙防禦卷軸60%
      2040602, //褲/裙防禦卷軸10%%10
      2040604, //褲/裙防禦詛咒卷軸%70
      2040605, //褲/裙防禦詛咒卷軸%30
      2040606, //褲裙跳躍詛咒卷軸%70
      2040607, //褲裙跳躍詛咒卷軸%30
      2040608, //褲裙體力詛咒卷軸%70
      2040609, //褲裙體力詛咒卷軸%30
      2040611, //褲裙敏捷詛咒卷軸30%
      2040612, //褲裙敏捷卷軸10%,  //成功率10%、敏捷+3、移動速度+3。
      2040614, //褲裙敏捷卷軸100%,  //成功率100%、敏捷+1。
      2040615, //褲裙防禦卷軸65%
      2040616, //褲裙防禦卷軸15%
      2040617, //褲裙跳躍卷軸,  //褲裙中增加彈跳上升選項。\n成功率:100%, 彈跳+1
      2040619, //褲裙跳躍卷軸10%,  //為裙褲增加跳躍力屬性。\n成功率：10%，跳躍力+4，回避值+40
      2040620, //褲裙體力卷軸,  //為裙褲增加體力屬性。\n成功率：100%，最大HP+20
      2040621, //褲裙體力卷軸60%,  //為裙褲增加體力屬性。\n成功率：60%，最大HP+60
      2040622, //褲裙體力卷軸10%,  //為裙褲增加體力屬性。\n成功率：10%，最大HP+120
      2040623, //褲裙敏捷卷軸,  //給褲裙增加敏捷度.\n成功率:100%, 敏捷+1
      2040626, //褲裙敏捷卷軸%30 %50失敗
      2040627, //褲裙敏捷卷軸10%
      2040631, //褲裙跳躍卷軸65%,  //為裙褲增加跳躍力屬性。\n成功率：65%，跳躍力+2，回避值+20
      2040632, //褲裙跳躍卷軸15%,  //為裙褲增加跳躍力屬性。\n成功率：15%，跳躍力+4，回避值+40
      2040633, //褲裙體力卷軸65%,  //為裙褲增加體力屬性。\n成功率：65%，最大HP+60
      2040634, //褲裙體力卷軸15%,  //為裙褲增加體力屬性。\n成功率：15%，最大HP+120
      2040636, //褲裙敏捷卷軸15%
      2040700, //鞋子敏捷度卷軸,  //為鞋子增加敏捷屬性。\n成功率：100%，回避值+20
      2040701, //鞋子敏捷度卷軸60%,  //為鞋子增加敏捷屬性。\n成功率：60%，回避值+40，命中值+20
      2040702, //鞋子敏捷度卷軸10%
      2040703, //鞋子跳躍卷軸,  //成功率100%，跳躍力+1.
      2040705, //鞋子跳躍卷軸10%,  //成功率10%，跳躍力+5，敏捷+3，移動速度+1.
      2040706, //鞋子速度卷軸,  //成功率100%，移動速度+1.
      2040707, //鞋子速度卷軸60%,  //成功率60%，移動速度+2.
      2040708, //鞋子速度卷軸10%,  //成功率10%，移動速度+3.
      2040711, //鞋子速度必成卷,  //成功率:100%, 移動速度+3
      2040712, //鞋子敏捷詛咒卷軸%70
      2040713, //鞋子敏捷詛咒卷軸%30
      2040716, //鞋子速度詛咒卷軸,  //成功率70%，移動速度+2\n但失敗時50%的比率道具消失
      2040717, //鞋子速度詛咒卷軸,  //成功率30%，移動速度+3\n但失敗時50%的比率道具消失
      2040718, //鞋子敏捷卷軸65%,  //為鞋子增加敏捷屬性。\n成功率：65%，回避值+40，命中值+20
      2040719, //鞋子敏捷卷軸15%,
      2040720, //鞋子跳躍卷軸65%,  //用來給鞋子中增加跳躍屬性。\n成功率：65%，跳躍力+2，敏捷+1
      2040721, //鞋子跳躍卷軸15%,
      2040722, //鞋子速度卷軸65%,  //用來給鞋子中增加速度屬性。\n成功率：65%，移動速度+2
      2040723, //鞋子速度卷軸15%,  //用來給鞋子中增加速度屬性。\n成功率：15%，移動速度+3
      2040727, //鞋子防滑卷軸,  //給鞋子增加防滑功能.\n成功率:10%, 對強化次數沒有影響
      2040800, //手套敏捷卷軸,  //為手套增加敏捷屬性。\n成功率：100%，命中值+20
      2040802, //手套敏捷卷軸10%,
      2040805, //手套攻擊卷軸10%,  //成功率10%，物理攻擊力+3.
      2040808, //手套敏捷詛咒卷軸,
      2040809, //手套敏捷詛咒卷軸,
      2040818, //手套魔力卷軸100%,  //成功率100%、魔法攻擊力+1。
      2040822, //手套攻擊卷軸15%,  //用來給手套中增加攻擊屬性。\n成功率：15%，攻擊力+3
      2040823, //手套體力卷軸,  //為手套增加體力屬性。\n成功率：100%，最大HP+20
      2040824, //手套體力卷軸60%,  //為手套增加體力屬性。\n成功率：60%，最大HP+60
      2040825, //手套體力卷軸10%,  //為手套增加體力屬性。\n成功率：10%，最大HP+120
      2040826, //手套攻擊卷軸,  //為手套增加攻擊力屬性。\n成功率：60%，物理攻擊力+2
      2040831, //手套體力卷軸65%,  //為手套增加體力屬性。\n成功率：65%，最大HP+60
      2040832, //手套體力卷軸15%,  //為手套增加體力屬性。\n成功率：15%，最大HP
      2040900, //盾牌防禦卷軸,  //為盾牌增加物理防禦力屬性。\n成功率：100%，物理防禦力+10
      2040901, //盾牌防禦卷軸60%,
      2040902, //盾牌防禦卷軸10%,
      2040903, //盾牌防禦必成卷,
      2040904, //盾牌防禦詛咒卷軸,
      2040905, //盾牌防禦詛咒卷軸,
      2040908, //盾牌體力卷軸,
      2040909, //盾牌體力卷軸,
      2040910, //盾牌防禦卷軸65%,
      2040911, //盾牌防禦卷軸15%,
      2040914, //盾牌攻擊卷軸60%,
      2040915, //盾牌攻擊卷軸10%,
      2040917, //盾牌攻擊詛咒卷軸30%
      2040920, //盾牌魔力卷軸10%,  //在盾牌賦予魔力提升屬性。\n成功率：10%，魔法攻擊力+3、智力+2
      2040923, //盾牌運氣卷軸,  //盾牌中增加運氣上升選項。\n成功率:100%, 幸運+1
      2040925, //盾牌運氣卷軸10%,  //盾牌中增加運氣上升選項。\n成功率:10%, 幸運+3
      2040926, //盾牌體力卷軸,  //為盾牌增加體力屬性。\n成功率：100%，最大HP+20
      2040927, //盾牌體力卷軸60%,  //為盾牌增加體力屬性。\n成功率：60%，最大HP+60
      2040928, //盾牌體力卷軸10%,  //為盾牌增加體力屬性。\n成功率：10%，最大HP+120
      2040929, //盾牌力量卷軸,  //給盾牌增加力量.\n成功率:100%, 力量+1
      2040930, //盾牌力量卷軸,
      2040932, //盾牌力量卷軸,
      2040933, //盾牌力量卷軸10%,  //給盾牌增加力量.\n成功率:10%, 力量+3
      2040938, //盾牌運氣卷軸15%,  //提高盾牌的運氣.\n成功率:15%, 運氣+3
      2040939, //盾牌體力卷軸65%,  //為盾牌增加體力屬性。\n成功率：65%，最大HP+60
      2040940, //盾牌體力卷軸15%,  //為盾牌增加體力屬性。\n成功率：15%，最大HP+120
      2040942, //盾牌力量卷軸15%,  //提高盾牌的力量.\n成功率:15%, 力量+3
      2041000, //披風魔防卷軸,  //為披風增加魔法防禦力屬性。\n成功率：100%，魔法防禦力+10
      2041001, //披風魔防卷軸60%,
      2041002, //披風魔防卷軸10%,
      2041003, //披風防禦卷軸,  //為披風增加物理防禦力屬性。\n成功率：100%，物理防禦力+10
      2041004, //披風防禦卷軸60%,
      2041005, //披風防禦卷軸10%,
      2041006, //披風體力卷軸,  //為披風增加最大HP屬性。\n成功率：100%，最大HP+20
      2041007, //披風體力卷軸60%,  //為披風增加最大HP屬性。\n成功率：60%，最大HP+40
      2041008, //披風體力卷軸10%,  //為披風增加最大HP屬性。\n成功率：10%，最大HP+80
      2041009, //披風魔力卷軸,  //為披風增加最大MP屬性。\n成功率：100%，最大MP+20
      2041010, //披風魔力卷軸60%,  //為披風增加最大MP屬性。\n成功率：60%，最大MP+40
      2041011, //披風魔力卷軸10%,  //為披風增加最大MP屬性。\n成功率：10%，最大MP+80
      2041012, //披風力量卷軸,  //成功率100%，力量+1
      2041014, //披風力量卷軸10%,  //成功率10%，力量+3
      2041015, //披風智力卷軸,  //成功率100%，智力+1
      2041017, //披風智力卷軸10%,  //成功率10%，智力+3
      2041018, //披風敏捷卷軸,  //成功率100%，敏捷+1
      2041020, //披風敏捷卷軸10%,  //成功率10%，敏捷+3
      2041021, //披風運氣卷軸,  //成功率100%，運氣+1
      2041023, //披風運氣卷軸10%,  //成功率10%，運氣+3
      2041025, //披風物理防禦必成卷,
      2041026, //披風魔防詛咒卷軸,
      2041027, //披風魔防詛咒卷軸,
      2041028, //披風防禦詛咒卷軸,
      2041029, //披風防禦詛咒卷軸,
      2041030, //披風體力詛咒卷軸,
      2041031, //披風體力詛咒卷軸,
      2041032, //披風魔力詛咒卷軸,
      2041033, //披風魔力詛咒卷軸,
      2041035, //披風力量詛咒卷軸,  //成功率30%，力量+3\n但失敗時50%的比率道具消失
      2041037, //披風智力詛咒卷軸,  //成功率30%，智力+3\n但失敗時50%的比率道具消失
      2041039, //披風敏捷詛咒卷軸,  //成功率30%，敏捷+3\n但失敗時50%的比率道具消失
      2041041, //披風運氣詛咒卷軸,  //成功率30%，運氣+3\n但失敗時50%的比率道具消失
      2041042, //披風魔法防禦卷軸65%,
      2041043, //披風魔法防禦卷軸15%,
      2041044, //披風物理防禦卷軸65%,
      2041045, //披風物理防禦卷軸15%,
      2041046, //披風體力卷軸65%,  //為披風增加最大HP屬性。\n成功率：65%，最大HP+40
      2041047, //披風體力卷軸15%,  //為披風增加最大HP屬性。\n成功率：15%，最大HP+80
      2041048, //披風魔力卷軸65%,  //為披風增加最大MP屬性。\n成功率：65%，最大MP+40
      2041049, //披風魔力卷軸15%,  //為披風增加最大MP屬性。\n成功率：15%，最大MP+80
      2041051, //披風力卷軸15%,  //用來增加披風的力量屬性。\n成功率：15%，力量+3
      2041053, //披風智力卷軸15%,  //用來增加披風的智力屬性。\n成功率：15%，智力+3
      2041055, //披風敏捷卷軸15%,  //用來增加披風的敏捷屬性。\n成功率：15%，敏捷+3
      2041057, //披風幸運卷軸15%,  //用來增加披風的幸運屬性。\n成功率：15%，幸運+3
      2041058, //披風防寒卷軸,  //給披肩增加防寒功能.\n成功率:10%, 對強化次數沒有影響
      /*2041100, //戒指力量卷軸
      2041101, //戒指力量卷軸
      2041102, //戒指力量卷軸10%
      2041103, //戒指智力卷軸
      2041104, //戒指智力卷軸
      2041105, //戒指智力卷軸10%
      2041106, //戒指敏捷卷軸
      2041107, //戒指敏捷卷軸
      2041108, //戒指敏捷卷軸
      2041109, //戒指運氣卷軸
      2041110, //戒指運氣卷軸
      2041111, //戒指運氣卷軸
      2041112, //戒指力量卷軸
      2041113, //戒指力量卷軸
      2041114, //戒指智力卷軸
      2041115, //戒指智力卷軸
      2041116, //戒指敏捷卷軸
      2041117, //戒指敏捷卷軸
      2041118, //戒指運氣卷軸
      2041119, //戒指運氣卷軸*/
      2041201, //項鏈運氣卷軸10%,  //成功率10%，運氣+3
      2041203, //項鏈運氣卷軸100%,  //成功率100%，運氣+1
      2041204, //項鏈運氣詛咒卷軸30%,  //成功率30%，運氣+3，但失敗時50%的機率道具消失。
      2041205, //項鏈運氣詛咒卷軸70%,  //成功率70%，運氣+2，但失敗時50%的機率道具消失。
      2041206, //項鏈力量卷軸10%,  //成功率10%，力量+3，最大HP+10
      2041208, //項鏈力量卷軸100%,  //成功率100%，力量+1
      2041209, //項鏈力量詛咒卷軸30%
      2041300, //腰帶力量卷軸100%
      2041302, //腰帶力量卷軸10%
      2041303, //腰帶智力卷軸100%
      2041305, //腰帶智力卷軸10%
      2041306, //腰帶敏捷卷軸100%
      2041308, //腰帶敏捷卷軸10%
      2041309, //腰帶運氣卷軸100%
      2041311, //腰帶運氣卷軸10%
      2041313, //腰帶力量卷軸
      2041315, //腰帶智力卷軸
      2041317, //腰帶敏捷卷軸
      2041319, //腰帶運氣卷軸
      2043000, //單手劍攻擊卷軸
      2043002, //單手劍攻擊卷軸10%
      2043005, //單手劍攻擊詛咒卷軸
      2043006, //單手劍魔力詛咒卷軸70%
      2043007, //單手劍魔力詛咒卷軸30%
      2043008, //單手劍魔力卷軸10%
      2043009, //單手劍魔力卷軸60%
      2043010, //單手劍魔力卷軸100%
      2043012, //單手劍攻擊卷軸15%
      2043015, //單手劍命中率卷軸
      2043016, //單手劍命中率卷軸
      2043017, //單手劍命中率卷軸60%
      2043018, //單手劍命中率卷軸
      2043019, //單手劍命中率卷軸10%
      2043024, //單手劍命中卷軸65%
      2043025, //單手劍命中卷軸15%
      2043100, //單手斧攻擊卷軸
      2043102, //單手斧攻擊卷軸10%
      2043105, //單手斧攻擊詛咒卷軸
      2043107, //單手斧攻擊卷軸15%
      2043110, //單手斧命中率卷軸
      2043111, //單手斧命中率卷軸
      2043112, //單手斧命中率卷軸60%
      2043113, //單手斧命中率卷軸
      2043114, //單手斧命中率卷軸10%
      2043118, //單手斧命中卷軸65%
      2043119, //單手斧命中卷軸15%
      2043200, //單手鈍器攻擊卷軸
      2043202, //單手鈍器攻擊卷軸10%
      2043205, //單手鈍器攻擊詛咒卷軸
      2043207, //單手鈍器攻擊卷軸15%
      2043210, //單手鈍器命中率卷軸
      2043211, //單手鈍器命中率卷軸
      2043212, //單手鈍器命中率卷軸60%
      2043213, //單手鈍器命中率卷軸
      2043214, //單手鈍器命中率卷軸10%
      2043218, //單手鈍器命中卷軸65%
      2043219, //單手鈍器命中卷軸15%
      2043300, //短劍攻擊卷軸
      2043302, //短劍攻擊卷軸10%
      2043305, //短劍攻擊詛咒卷軸
      2043307, //短劍攻擊卷軸15%
      2043400, // 刀攻擊力卷軸 100%
      2043402, // 刀攻擊力卷軸 10%
      2043404, //刀攻擊力卷軸
      2043700, //短杖魔力卷軸
      2043702, //短杖魔力卷軸10%
      2043705, //短杖魔力詛咒卷軸
      2043707, //短杖魔力卷軸15%
      2043714, //短杖魔力卷軸
      2043800, //長杖魔力卷軸
      2043802, //長杖魔力卷軸10%
      2043805, //長杖魔力詛咒卷軸
      2043807, //長杖魔力卷軸15%
      2043814, //長杖魔力卷軸
      2044000, //雙手劍攻擊卷軸
      2044002, //雙手劍攻擊卷軸10%
      2044005, //雙手劍攻擊詛咒卷軸
      2044007, //雙手劍攻擊卷軸15%
      2044010, //雙手劍命中率卷軸
      2044011, //雙手劍命中率卷軸
      2044012, //雙手劍命中率卷軸60%
      2044013, //雙手劍命中率卷軸
      2044014, //雙手劍命中率卷軸10%
      2044015, //雙手劍攻擊卷軸
      2044026, //雙手劍命中卷軸65%
      2044027, //雙手劍命中卷軸15%
      2044100, //雙手斧攻擊卷軸
      2044102, //雙手斧攻擊卷軸10%
      2044105, //雙手斧攻擊詛咒卷軸
      2044107, //雙手斧攻擊卷軸15%
      2044110, //雙手斧命中率卷軸
      2044111, //雙手斧命中率卷軸
      2044112, //雙手斧命中率卷軸60%
      2044113, //雙手斧命中率卷軸
      2044114, //雙手斧命中率卷軸10%
      2044118, //雙手斧命中卷軸65%
      2044119, //雙手斧命中卷軸15%
      2044200, //雙手鈍器攻擊卷軸
      2044202, //雙手鈍器攻擊卷軸10%
      2044205, //雙手鈍器攻擊詛咒卷軸
      2044207, //雙手鈍器攻擊卷軸15%
      2044210, //雙手鈍器命中率卷軸
      2044211, //雙手鈍器命中率卷軸
      2044212, //雙手鈍器命中率卷軸60%
      2044213, //雙手鈍器命中率卷軸
      2044214, //雙手鈍器命中率卷軸10%
      2044218, //單手鈍器命中卷軸65%
      2044219, //單手鈍器命中卷軸15%
      2044300, //槍攻擊卷軸
      2044302, //槍攻擊卷軸10%
      2044305, //槍攻擊詛咒卷軸
      2044307, //槍攻擊卷軸15%
      2044310, //槍命中率卷軸
      2044311, //槍命中率卷軸
      2044312, //槍命中率卷軸
      2044313, //槍命中率卷軸
      2044314, //槍命中率卷軸10%
      2044318, //槍命中卷軸65%
      2044319, //槍命中卷軸15%
      2044400, //矛攻擊卷軸
      2044402, //矛攻擊卷軸10%
      2044405, //矛攻擊詛咒卷軸
      2044407, //矛攻擊卷軸15%
      2044410, //矛命中率卷軸
      2044411, //矛命中率卷軸
      2044412, //矛命中率卷軸
      2044413, //矛命中率卷軸
      2044414, //矛命中率卷軸
      2044418, //矛命中卷軸65%
      2044419, //矛命中卷軸15%
      2044500, //弓攻擊卷軸
      2044502, //弓攻擊卷軸10%
      2044505, //弓攻擊詛咒卷軸
      2044507, //弓攻擊卷軸15%
      2044600, //弩攻擊卷軸
      2044602, //弩攻擊卷軸10%
      2044605, //弩攻擊詛咒卷軸
      2044607, //弩攻擊卷軸15%
      2044700, //拳套攻擊卷軸
      2044702, //拳套攻擊卷軸10%
      2044705, //拳套攻擊詛咒卷軸
      2044707, //拳套攻擊卷軸15%
      2044800, // 拳甲攻擊卷軸
      2044802, //拳甲攻擊卷軸10%
      2044804, // 拳甲攻擊卷軸
      2044805, // 拳甲命中率卷軸
      2044806, // 拳甲命中率卷軸
      2044807, //拳甲命中率卷軸60%
      2044808, // 拳甲命中率卷軸
      2044809, //拳甲命中率卷軸10%
      2044812, //指節攻擊卷軸15%
      2044813, //指節命中卷軸65%
      2044814, //指節命中卷軸15%
      2044900, //短槍攻擊卷軸
      2044902, //短槍攻擊卷軸10%
      2044904, //短槍攻擊卷軸
      2044907, //火槍攻擊捲軸15%
      2040000  //頭盔防禦卷軸100%
    ]
  },

  lottery: {
    // 機率，千分之 x
    chance: 50,

    // 數量，範圍是 1 ~ x
    quantity: 1,

    // 廣播名稱，null 為不廣播
    broad: null,

    // 物品
    collection: [
      4031365 // 楓葉彩票
    ]
  },

  consolation: {
    // 機率，千分之 x
    chance: 150,

    // 數量，範圍是 1 ~ x
    quantity: 20,

    // 廣播名稱，null 為不廣播
    broad: null,

    // 物品
    collection: [
      2000004, // 特殊藥水
      2000005  // 超級藥水
    ]
  }
};

function endSession(msg) {
  cm.sendOk(msg);
  cm.safeDispose();
}

function action(mode, type, selection) {
  if (1 === mode) {
    status++;
  } else {
    if (0 === status) {
      return endSession('隨時都歡迎你來試試手氣！');
    }

    status--;
  }

  if (0 === status) {
    if (cm.getPlayerStat('LVL') < 30) {
      return endSession('你的等級不能小於 30 等。');
    } else if (! cm.haveItem(5220000)) { //快樂百寶券
      return endSession('你沒有轉蛋券，可以到商城購買轉蛋券哦。');
    } else if (! cm.canHold()) {
      return endSession('請確認背包所有欄位是否都有一格以上的空間。');
    }

    var flag = 0;

    var totalChance = Object.keys(items).reduce(function (acc, val) {
      if (0 === items[val].collection.length) {
        flag = 1;
      }

      return acc + items[val].chance;
    }, 0);

    if (1000 !== totalChance) {
      return endSession('似乎發生了點問題，請回報管理員錯誤代碼「1」。');
    } else if (1 === flag) {
      return endSession('似乎發生了點問題，請回報管理員錯誤代碼「2」。');
    }

    cm.sendYesNo('你持有#b轉蛋券#k，要試試手氣嗎？');
  } else if (1 === status) {
    var prop;
    var chance = Math.floor(Math.random() * 1000);
    var bounds = {
      lower: 0,
      upper: 1000
    };

    for (prop in items) {
      if (! items.hasOwnProperty(prop)) {
        continue;
      }

      bounds.upper = bounds.lower + items[prop].chance;

      if (chance >= bounds.lower && chance < bounds.upper) {
        break;
      }

      bounds.lower = bounds.upper;
    }

    var itemId = items[prop].collection[Math.floor(Math.random() * items[prop].collection.length)];

    var item = cm.gainGachaponItem(
      itemId,
      Math.floor(Math.random() * Math.max(items[prop].quantity, 1)) + 1,
      items[prop].broad || '轉蛋機',
      null !== items[prop].broad
    );

    if (-1 === item) {
      cm.sendOk('似乎發生了點問題，請稍候再嘗試，並將「' + itemId + '」此代號回報給管理員。');
    } else {
      cm.gainItem(5220000, -1);
      cm.sendOk("你得到了#b#t" + item + "##k。");
    }

    cm.safeDispose();
  }
}
